/**
 * Created by major.miao 2017-11-07
 * 获取社区的数据
 * See http://expressjs.com/zh-cn/4x/api.html
 */

module.exports = {
	api: '/api/getCommunityList',
	response: function(req, res) {
		console.log(req.query.communityType);
		if (req.query.communityType == 1) {
			var json = {
				"type": "1",
				"headTitle": '股权',
				"headDesc": '股权版块介绍，有一种在结合众多风险个体描述的基础上。',
				"countTopic": '20',
				"countComment": '1532',
				"topic": [{
					"userName": "major",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major1",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major2",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major3",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major4",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major5",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major6",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major7",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major8",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major9",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major10",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major11",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major12",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major13",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major14",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major15",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major16",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major17",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}]
			};
		} else {
			var json = {
				"type": "1",
				"headTitle": '股权',
				"headDesc": '股权版块介绍，有一种在结合众多风险个体描述的基础上。',
				"countTopic": '20',
				"countComment": '1532',
				"topic": [{
					"userName": "major22222",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}, {
					"userName": "major12222222",
					"mark": "官方账号",
					"date": "2017-11-05",
					"content": "那么多保险产品，除了普通的生活类，理财型投资选哪个比较好理财型投资选哪个比较好理财型投资选哪个比较好"
				}]
			};
		}
		res.send(json);
	}
}